import time

''' 1. Напишите программу, которая принимает на вход вещественное число
и показывает сумму его цифр. Учтите, что числа могут быть отрицательными.
Пример:
67,82 -> 23
0,56 -> 11'''

float_num = input('input float number: ')
print(type(float_num))
sum = 0
for i in float_num:
    if i != '.' and i != '-':
        sum += int(i)
print(sum)


'''2 - Напишите программу, которая принимает на вход число N и выдает набор произведений
(набор - это список) чисел от 1 до N.
Не используйте функцию math.factorial.
Добавьте проверку числа N: чтобы пользователь не мог ввести буквы.
Пример: - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)'''

n = int(input('input N: '))
factorial = 1
for i in range(1, n+1):
    factorial *= i
    print(factorial, end=' ')

'''3 - Палиндромом называется слово, которое в обе стороны читается одинаково: "шалаш", "кабак".
А еще есть палиндром числа - смысл также в том, чтобы число в обе стороны читалось одинаково, но есть одно "но".
Если перевернутое число не равно исходному, то они складываются и проверяются на палиндром еще раз.
Это происходит до тех пор, пока не будет найден палиндром.
Напишите такую программу, которая найдет палиндром введенного пользователем числа.'''

n = int(input("Введите число:"))
temp = n
rev = 0
i = 0
isPol = True
while (isPol):
    while(n > 0):
        dig = n % 10
        rev = rev * 10 + dig
        n = n // 10
    if(temp == rev):
        print(temp, "Это палиндром!")
        isPol = False
    else:
        print(temp, "Это не палиндром!")
        n = temp + rev
        temp = n
        rev = 0
    i+=1

'''4 Реализуйте выдачу случайного числа при этом нельзя использовать random.randint и вообще библиотеку
random. Можете использовать xor, биты, библиотеку time или datetime (миллисекунды или наносекунды) - для задания случайности
Учтите, что есть диапазон: от(минимальное) и до (максимальное)'''

def random_number(minimum,maximum):
    now = str(time.perf_counter())
    rnd = float(now[::-1][:3:])/1000
    return minimum + rnd*(maximum-minimum)

print(int(random_number(1,100)))     